// 다차원 배열 (multidimenstional array)

let twoDimensional = [[1,2], [3,4]];

console.log(twoDimensional[0][1]);


let myFridge = [
    ['참외', '토마토', '오이', '양파'],
    ['볶음멸치', '장조림', '김치'],
    ['사이다', '콜라', '물', '쥬스'],
    ['사과', '바나나', '청포도'],
    ['얼음'],
    ['찰떡아이스', '투게더', '메로나']
];

let mailbox = [
    [101, 201, 301, 501, 601],
    [102, 202, 302, 502, 602],
    [103, 203, 303, 503, 603],
    [104, 204, 304, 504, 604],
    [105, 205, 305, 505, 605]
]

let chessBoard = [
    ['R', 'N', 'B', 'Q', 'K', 'B', 'N', 'R'],
    ['P', 'P', 'P', 'P', 'P', 'P', 'P', 'P'],
    [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
    [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
    [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
    [' ', ' ', ' ', ' ', ' ', ' ', ' ', ' '],
    ['p', 'p', 'p', 'p', 'p', 'p', 'p', 'p'],
    ['r', 'n', 'b', 'q', 'k', 'b', 'n', 'r']
]